{
  "account_already_exists": "L'adresse email fournie pour la création d'un compte différé a déjà un compte associé. Utilisez OAuth flow pour vous connecter au compte existant à votre plateforme.",
  "account_country_invalid_address": "Le pays de l'adresse fournie ne correspond pas au pays du compte. L'entreprise doit se situer dans le même pays que le compte.",
  "account_invalid": "L'identifiant fourni comme correspondant au header Stripe-Account est invalide. Vérifiez que vos requêtes spécifient un identifiant de compte valide.",
  "account_number_invalid": "Le numéro de compte fourni est invalide (e.g., chiffres manquants). Les informations de compte banquaire peuvent varier suivant les pays. Nous recommandons de créer des validateurs dans vos formulaires d'entrée en suivant les formats de compte bancaires que nous fournissons.",
  "alipay_upgrade_required": "Cette méthode création de paiement Alipay n'est plus supportée. Merci de mettre à jour votre intégration pour utiliser Sources à la place.",
  "amount_too_large": "Le montant spécifié est supérieur au maximum permis. Utilisez un montant inférieur et réassayez.",
  "amount_too_small": "Le montant spécifié est inférieur au maximum permis. Utilisez un montant supérieur et réassayez.",
  "api_key_expired": "La clé d'API fournie a expiré. Obtenez vos clés d'API actuelles depuis votre Dashboard et mettez à jour votre intégration pour les utiliser.",
  "authentication_required": "Le paiement requiert d'être authentifié pour aboutir. Notifiez votre client de retourner dans l'application pour compléter le paiement. Voyez notre guide sur les paiements off-sessions pour plus d'informations.",
  "balance_insufficient": "Le transfert ou paiement n'a pas pu être complété car le compte associé n'a pas les fonds suffisants disponibles. Créez un nouveau transfert ou paiement en utilisant un montant inférieur ou égal au montant disponible du compte.",
  "bank_account_declined": "Le compte bancaire fourni ne peut pas être utilisé pour payer, soit car il n'est pas encore vérifé, soit car il n'est pas supporté.",
  "bank_account_exists": "Le compte banquaire fourni existe déjà pour l'objet Customer. Si ce compte bancaire doit être associé à un client différent, incluez le bon identifiant client au moment de refaire la requête.",
  "bank_account_unusable": "Le compte bancaire fourni ne peut pas être utilisé pour les paiements. Un compte bancaire différent doit être utilisé.",
  "bank_account_unverified": "Votre plateforme Connect tente de partager un compte bancaire non vérifié avec un compte connecté.",
  "bank_account_verification_failed": "Le compte bancaire ne peut pas être vérifé, soit car les montants de microdépositions ne correspondent pas aux montants actuels, soit car la vérification a échoué de trop nombreuses fois.",
  "bitcoin_upgrade_required": "Cette méthode pour créer des paiements Bitcoin n'est plus supportée. Merci de mettre à jour votre intégration pour utiliser Sources à la place.",
  "card_decline_rate_limit_exceeded": "Cette carte a été refusée de trop nombreuses fois. Vous pouvez essayer d'utiliser à nouveau cette carte dans 24 heures. Nous vous suggérons de contacter votre client pour être sur qu'ils ont entré toutes leurs informations correctement et qu'il n'y a pas de problème avec leur carte.",
  "card_declined": "La carte a été refusée. Quand une carte est refusée, l'erreur retournée inclus l'attribut decline_code avec la raison pour laquelle la carte a été déclinée. Refferez-vous à notre documentation des codes de refus pour plus d'informations.",
  "charge_already_captured": "La charge Stripe que vous tentez de capturer a déjà été capturée. Mettez à jour votre requête avec un identifiant de charge non capturé.",
  "charge_already_refunded": "La charge Stripe que vous tentez de rembourser l'a déjà été. Mettez à jour votre requête avec un identifiant de charge non remboursé.",
  "charge_disputed": "La charge Stripe que vous tentez de rembourser a déjà été rétrofacturée. Referrez-vous à la documentation sur les contestations pour savoir comment traiter ce cas.",
  "charge_exceeds_source_limit": "Cette charge Stripe vous ferait dépasser la limite de traitement de votre créneau pour ce type de source. Merci de réessayer cette charge plus tard, ou de nous contacter pour demander une limite de traitement supérieure.",
  "charge_expired_for_capture": "Cette charge Stripe ne peut pas être traitée car l'autorisation a expirée. L'authentification et les charges de captures doivent être capturées avant sept jours.",
  "charge_invalid_parameter": "Un ou plusieurs paramètres n'ont pas été permis pour cette opération sur la Charge. Vérifiez notre référence d'API ou le message d'erreur retourné pour voir quelles valeurs n'étaient pas correctes pour cette Charge.",
  "country_unsupported": "Votre plateforme a essayé de créer un compte personnalisé dans un pays qui n'est pas encore supporté. Faites attention à ce que les utilisateurs ne puissent uniquement s'inscrire depuis des pays permettant les comptes personnalisés.",
  "coupon_expired": "Le coupon fourni pour cette inscription ou commande a expiré. Créez un nouveau coupon, ou utilisez-en un valide.",
  "customer_max_subscriptions": "Le nombre maximum d'inscriptions pour un client a été atteint. Contactez-nous si vous recevez cette erreur.",
  "email_invalid": "Cette adresse email est invalide. (e.g., formattée incorrectement). Vérifiez que cette adresse email est formattée correctement et n'incluez que les caractères permis.",
  "expired_card": "La carte a expiré. Vérifiez la date d'expiration ou utiliser une carte différente.",
  "idempotency_key_in_use": "La clé d'idempotence fournie est actuellement utilisée par une autre requête. Cela arrive si votre intégration fait des requêtes dupliquées simultanément.",
  "incorrect_address": "L'adresse de cette carte est incorrecte. Vérifiez l'adresse de cette carte ou utilisez-en une différente.",
  "incorrect_cvc": "Le code de sécurité de cette carte est incorrect. Vérifiez le code de sécurité de cette carte ou utilisez-en une différente.",
  "incorrect_number": "Le numéro de cette carte est incorrect. Vérifiez le numéro de cette carte ou utilisez-en une différente.",
  "incorrect_zip": "Le code postal de cette carte est incorrect. Vérifiez le code postal de cette carte ou utilisez-en une différente.",
  "instant_payouts_unsupported": "Cette carte n'est pas éligible pour les paiements instantannés. Essayez une carte de débit d'une banque supportée.",
  "invalid_card_type": "La carte fournie comme compte externe n'est pas supportée pour les paiements. Fournissez une carte non-prépayée à la place.",
  "invalid_charge_amount": "Le montant spécifié est invalide. Le montant de charge doit être un entier positif dans la plus petite unité de la devise, et ne doit pas dépasser le montant minimum ou maximum.",
  "invalid_cvc": "Le code de sécurité de cette carte est invalide. Vérifiez le code de sécurité de la carte ou utilisez une autre carte.",
  "invalid_expiry_month": "Le mois d'expiration de cette carte est incorrect. Vérifiez la date d'éxpiration ou utilisez une autre carte.",
  "invalid_expiry_year": "L'année d'expiration de cette carte est incorrect. Vérifiez la date d'éxpiration ou utilisez une autre carte.",
  "invalid_number": "Ce numéro de carte est invalide. Vérifiez les détails de la carte ou utilisez-en une autre.",
  "invalid_source_usage": "Cette source ne peut pas être utilisée car elle n'est pas dans le bon état (e.g., une requête de charge essaye d'utiliser une source dans l'état pending, failed, ou consumed). Vérifiez le statut de la source que vous essayez d'utiliser.",
  "invoice_no_customer_line_items": "La facture ne peut pas être générée pour ce client car il n'y a pas d'item de facturation en attente. Vérifiez que le bon client a été séléctionné ou créez un item de facturation si nécessaire.",
  "invoice_no_subscription_line_items": "La facture ne peut pas être générée pour cette subscription car il n'y a pas d'item de facturation en attente. Vérifiez que la bonne subscription a été séléctionnée ou créez un item de facturation si nécessaire.",
  "invoice_not_editable": "La facture spécifiée ne peut plus être éditée. Essayez plutôt de créer de nouveaux items de facturation qui seront appliqués à la prochaine facturation. Vous pouvez manuellement générer la prochaine facturation ou attendre qu'elle soit automatiquement générée à la fin d'un cycle de facturation.",
  "invoice_payment_intent_requires_action": "Ce paiement requiert des actions additionnelles de l'utilisateur avant de pouvoir être complété. Le paiement peut être complété en utilisant le PaymentIntent associé à la facture. Réferrez-vous à https://stripe.com/docs/billing/subscriptions/payment#handling-action-required pour plus d'informations.",
  "invoice_upcoming_none": "Il n'y a pas d'aperçu de facture en attente pour le client spécifié. Seuls les clients avec un abonnement actif ou un item de facturation en attente ont accès à des aperçus de factures.",
  "livemode_mismatch": "Les clés d'API, requêtes et objets des modes test et live sont seulements disponibles dans leur mode.",
  "lock_timeout": "Cet objet n'est pas accessible actuellement car une autre requête d'API ou un autre process Stripe y accède actuellement. Si vous voyez cette erreur par intermittence, relancez la requête. Si vous voyez cette erreur fréquemment et faites plusieurs requêtes concurrentes sur un seul objet, faites vos requêtes en série ou à une fréquence plus basse.",
  "missing": "À la fois un identifiant de client et de source ont été fournis, mais la source n'a pas été enregistrée au client. Pour créer une charge Stripe for un client avec une source particulière, vous devez d'abord enregistrer les détails de la carte.",
  "not_allowed_on_standard_account": "Les transferts et les paiements de la part d'un compte connecté Standard ne sont pas permis.",
  "order_creation_failed": "La commande ne peut pas être crée. Vérifiez les détails de la commande et réessayez.",
  "order_required_settings": "La commande n'a pas pu être complétée car il manque des informations requises. Vérifiez les informations fournies et réessayez.",
  "order_status_invalid": "La commande n'a pas pu être mise à jour car le status fourni est soit invalide soit ne suit l'ordre correct d'exécution (e.g., une commande ne peut pas transitionner de l'état created à fulfilled sans passer par paid).",
  "order_upstream_timeout": "La requête a été time out. Réessayez plus tard.",
  "out_of_inventory": "Le SKU est indisponible. Si plus de stock est disponible, mettre à jour la quantité de l'inventaire du SKU et réessayer.",
  "parameter_invalid_empty": "Une ou plusieurs valeurs n'ont pas été fournies. Vérifiez que les requêtes contiennent tous les paramètres requis.",
  "parameter_invalid_integer": "Un ou plusieurs paramètres requièrent un entier, mais les valeurs fournies étaient d'un type différent. Faites attention à ce que seules des valeurs supportées soient fournies pour chaque attribut. Referrez-vous à notre documentation d'API pour chercher le type de donnée que chaque attribut supporte.",
  "parameter_invalid_string_blank": "Une ou plusieurs valeures fournies incluent seulement des espaces. Vérifiez que les valeurs dans votre requête et mettez à jour celles qui ne contiennent que des espaces.",
  "parameter_invalid_string_empty": "Une ou plusieurs chaines requises sont vides. Vérifiez que les chaines contiennent au moins un caractère.",
  "parameter_missing": "Une ou plusieurs valeurs requises sont manquantes. Vérifiez notre documentation d'API pour voir quelles valeurs sont requises pour créer ou modifier la resource spécifiée.",
  "parameter_unknown": "La requête contient un ou plusieurs paramètres inattendus. Supprimez-les et réessayez.",
  "parameters_exclusive": "Deux ou plus paramètres mutuellements exclusifs ont été fournis. Vérifiez notre documentation d'API ou le message d'erreur pour voir quelles valeurs sont permises lors de la création ou la modification de la resource spécifiée.",
  "payment_intent_authentication_failure": "Le moyen de paiement fourni a échoué à s'authentifier. Fournissez une nouvelle méthode de paiement pour essayer à nouveau de compléter ce PaymentIntent.",
  "payment_intent_incompatible_payment_method": "Le PaymentIntent attendait une méthode de paiement avec des propriétés différentes de ce qui a été fourni.",
  "payment_intent_invalid_parameter": "Un ou plusieurs paramètres fournis n'ont pas été permis pour l'opération sur le PaymentIntent. Vérifiez notre référence d'API ou le message d'erreur retourné pour voir quelles valeurs étaient incorrectes pour ce PaymentIntent.",
  "payment_intent_payment_attempt_failed": "La dernière tentative de paiement a échoué. Vérifier la propriété last_payment_error du PaymentIntent pour plus de détails, et fournissez une nouvelle méthode de paiement pour compléter ce PaymentIntent à nouveau.",
  "payment_intent_unexpected_state": "L'état du PaymentIntent était incompatible avec la tentative d'opération.",
  "payment_method_unactivated": "La charge ne peut pas être crée car la méthode de paiement n'a pas été activée. Activez le moyen de paiement depuis le Dashboard puis réessayez.",
  "payment_method_unexpected_state": "L'état du moyen de paiement fourni était incompatible avec la tentative d'opération. Confirmez que la méthode de paiement est dans un état permis pour l'opération donnée avant de réessayer.",
  "payouts_not_allowed": "Les paiements ont été désactivés pour le compte connecté. Vérifiez le statut du compte pour voir si des informations supplémentaires doivent être fournies, ou si les paiements ont été supprimés pour une autre raison.",
  "platform_api_key_expired": "La clé d'API fournie par votre plateforme Connect a expiré. Cela arrive si votre plateforme a soit généré une nouvelle clé ou si le compte a été déconnecté de la plateforme. Obtenez votre clé d'API actuelle depuis le Dashboard et mettez à jour votre intégration, ou contactez l'utilisateur et reconnectez le compte.",
  "postal_code_invalid": "Le code postal fourni est incorrect.",
  "processing_error": "Une erreur est survenue pendant le traitement de la carte. Vérifiez que les détails de la carte sont corrects ou utilisez une autre carte.",
  "product_inactive": "Le produit auquel appartient ce SKU n'est plus disponible à l'achat.",
  "rate_limit": "Trop de requêtes ont atteint cette API trop rapidement. Nous recommandons un ralentissement exponentiel de vos requêtes.Too many requests hit the API too quickly.",
  "resource_already_exists": "Une resouece avec un ID spécifié par l'utilisateur existe déjà (e.g., un plan ou un coupon).Utilisez une valeur différente et unique comme ID et réessayez.",
  "resource_missing": "L'ID fourni n'est pas valide. Soit la resource n'existe pas, soit un ID pour une resource différente a été fourni.",
  "routing_number_invalid": "Le numéro de banque fourni est invalide.",
  "secret_key_required": "La clé d'API fournie est une clé publiable, mais une clé secrète est requise. Obtenez vos clés d'API actuelles depuis le Dashboard et mettez à jour votre intégration pour les utiliser.",
  "sepa_unsupported_account": "Votre compte ne supporte pas les paiements SEPA",
  "setup_attempt_failed": "La dernière tentative de configuration du SetupIntent a échoué. Vérifiez la propriété last_setup du SetupIntent pour plus de détails, et fournissez un nouveau moyen de paiement pour essayer à nouveau de le configurer.",
  "setup_intent_authentication_failure": "Le moyen de paiement fourni a échoué à l'authetification. Fournissez un nouveau moyen de paiement pour tenter de compléter à nouveau le SetupIntent.",
  "setup_intent_unexpected_state": "L'état du SetupIntent était incompatible avec l'opération dont l'exécution a été demandée.",
  "shipping_calculation_failed": "Le calcul du coût de livraison a échoué car les informations fournies étaient incorrectes ou n'ont pas pu être vérifiées.",
  "sku_inactive": "Le SKU est inactif est n'est plus disponible pour l'achat. Utilisez un SKU différent, ou rendez le SKU actuel de nouveau actif.",
  "state_unsupported": "Arrive quand une information de legal_entity est fournie pour un compte U.S. custom, si l'état fourni n'est pas supporté. (Ce sont généralement les associated states and territories.)",
  "tax_id_invalid": "L'identifiant de numéro de tax fourni est invalide (e.g., chiffres manquants). Les informations d'identifiant de tax varient suivant les pays, mais doivent être d'au moins neuf chiffres.",
  "taxes_calculation_failed": "La calculation de tax pour la commande a échoué.",
  "testmode_charges_only": "Votre compte n'a pas été activé et ne peux faire que des charges de test. Activez votre compte depuis le Dashboard pour commencer à process des charges live.",
  "tls_version_unsupported": "Votre intégration utilise une version trop ancienne de TLS qui n'est plus supportée. Vous devez utiliser TLS 1.2 ou supérieur.",
  "token_already_used": "Le token fourni a déjà été utilisé. Vous devez créer un nouveau token avant de pouvoir réessayer de faire cette requête.",
  "token_in_use": "Le roken fourni est actuellement utilisé par une autre requête. Cela arrive si votre intégration fait des requêtes dupliquées simultanément.",
  "transfers_not_allowed": "Le transfer requis ne peut pas être crée. Contactez-nous si vous recevez cette erreur.",
  "upstream_order_creation_failed": "Cette commande n'a pas pu être crée. Vérifiez les détails de la commande et réessayez.",
  "url_invalid": "L'URL fournie est invalide"
}
